In [1]:
import pandas as pd
import numpy as np
import sqlalchemy

# Create a temporary sqlite database
database_connection_string = 'sqlite:///'

# Create an engine to interact with the database
engine = sqlalchemy.create_engine(database_connection_string)

In [2]:
stocks_dataframe = pd.DataFrame({'AAPL': [1, 2, 3], 'GOOG': [4, 5, 6]})
stocks_dataframe.to_sql('stocks', engine)
engine.table_names()

C:\Users\vglup\anaconda3\envs\dev\lib\site-packages\ipykernel_launcher.py:3: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  This is separate from the ipykernel package so we can avoid doing imports until

['stocks']

In [3]:
query = """
SELECT AAPL FROM stocks
WHERE AAPL < 3;
"""
apple_df = pd.read_sql_query(query, con=engine)
apple_df

   AAPL
0     1
1     2

In [4]:
query = """
SELECT AAPL FROM stocks
WHERE AAPL = 1 OR AAPL = 3;
"""
df = pd.read_sql_query(query, con=engine)
df

   AAPL
0     1
1     3